//
//  OxfordHappinessTestData.swift
//  PsychologyTest
//
//  Created by Кирилл Колено on 11/11/2017.
//  Copyright © 2017 BlackWoodTraders. All rights reserved.
//

import Foundation

struct OxfordHappinessTestData {
    let questions = [
        ["я не чувствую себя счастливым",
            "я чувствую себя довольно счастливым",
            "я очень счастлив",
            "я невероятно счастлив"
            ],
        ["я смотрю в будущее без особого оптимизма",
            "я смотрю в будущее с оптимизмом",
            "мне кажется, будущее сулит мне много хорошего",
            "я чувствую, что будущее переполнено надеждами и перспективами"
            ],
       ["ничто в моей жизни по-настоящему меня не удовлетворяет",
            "некоторые вещи в жизни меня удовлетворяют",
            "меня удовлетворяет многое в моей жизни",
            "я полностью удовлетворен всем в своей жизни"
            ],
        ["я не ощущаю, что в жизни что-либо реально находится в моей власти",
            "я чувствую, что контролирую свою жизнь, по крайней мере — отчасти",
            "я чувствую, что в основном контролирую свою жизнь",
            "я чувствую, что целиком контролирую все стороны своей жизни"
            ],
        ["я не ощущаю, что жизнь вознаграждает меня по заслугам",
            "я ощущаю, что в жизни мне воздается по заслугам",
            "я ощущаю, что жизнь щедро вознаграждает меня",
            "я ощущаю, что жизнь переполнена подарками"
            ],
        ["я не испытываю никакой удовлетворенности жизнью",
            "я доволен тем, как я живу",
            "я очень доволен тем, как я живу",
            "я в восторге от своей жизни"
            ],
        ["я никогда не могу повлиять на события в нужном мне направлении",
            "иногда я способен повлиять на события в нужном мне направлении",
            "я часто влияю на события в нужном мне направлении",
            "я всегда влияю на события в нужном мне направлении"
            ],
        ["в жизни я просто выживаю",
            "жизнь — хорошая вещь",
            "жизнь — замечательная вещь",
            "я обожаю жизнь"
            ],
        ["у меня потерян всякий интерес к другим людям",
            "другие люди интересны мне отчасти",
            "другие люди меня очень интересуют",
            "меня чрезвычайно интересуют другие люди"
            ],
        ["мне трудно принимать решения",
             "я довольно легко принимаю некоторые решения",
             "мне довольно просто принимать большинство решений",
             "я с легкостью принимаю любые решения"
            ],
        ["мне трудно приступить к какому-либо делу",
             "мне довольно просто что-либо начать",
             "я без труда принимаюсь за какое-либо дело",
             "я способен взяться за любое дело"
            ],
        ["после сна я редко чувствую себя отдохнувшим",
             "иногда я просыпаюсь отдохнувшим",
             "после сна я обычно чувствую себя отдохнувшим",
             "я всегда просыпаюсь отдохнувшим"
            ],
        ["я чувствую себя совершенно без сил",
             "я чувствую себя довольно энергичным",
             "я чувствую себя очень энергичным",
             "я чувствую, что энергия во мне бьет через край"
            ],
        ["я не вижу в окружающих меня вещах особой красоты",
             "я нахожу красоту в некоторых вещах",
             "я нахожу красоту в большинстве вещей",
             "весь мир представляется мне прекрасным"
            ],
        ["я не ощущаю себя сообразительным",
             "я чувствую, что отчасти сметлив",
             "я в значительной степени чувствую в себе живость ума",
             "я ощущаю, что мне присуща совершенная живость ума"
            ],
        ["я не чувствую себя особенно здоровым",
             "я чувствую себя достаточно здоровым",
             "я чувствую себя совершенно здоровым",
             "я чувствую себя здоровым на 100%"
            ],
        ["я не испытываю особо теплых чувств по отношению к другим",
             "я испытываю определенные теплые чувства по отношению к другим",
             "я испытываю очень теплые чувства по отношению к другим",
             "я люблю всех людей"
            ],
        ["у меня практически нет счастливых воспоминаний",
             "у меня есть отдельные счастливые воспоминания",
             "большинство произошедших со мной событий представляются мне счастливыми",
             "все происшедшее кажется мне чрезвычайно счастливым"
            ],
        ["я никогда не бываю в радостном или приподнятом настроении",
             "иногда я испытываю радость и пребываю в приподнятом настроении",
             "я часто испытываю радость и пребываю в приподнятом настроении",
             "я все время радуюсь и пребываю в приподнятом настроении"
            ],
        ["между тем, что я хотел бы сделать, и тем, что сделал, — большая разница",
             "кое-что из желаемого я сделал",
             "я сделал многое из того, что хотел",
             "я сделал все, чего когда-либо желал"
            ],
        ["я не способен хорошо организовать свое время",
             "я организую свое время достаточно хорошо",
             "я очень хорошо организую свое время",
             "мне удается успеть все, что я хочу сделать"
            ],
        ["мне не бывает весело в компании других людей",
             "иногда мне бывает весело с другими людьми",
             "мне часто бывает весело с другими людьми",
             "мне всегда весело в окружении людей"
            ],
        ["я никогда не подбадриваю окружающих",
             "иногда я подбадриваю окружающих",
             "я часто подбадриваю окружающих",
             "я всегда подбадриваю окружающих"
            ],
        ["у меня нет ощущения осмысленности и цели в жизни",
             "у меня есть ощущение смысла и цели в жизни",
             "у меня ясное ощущение смысла и цели в жизни",
             "моя жизнь полна смысла и имеет цель"
            ],
        ["я не ощущаю особой привязанности к другим и сопричастности",
             "иногда я ощущаю привязанность к людям и сопричастность",
             "я часто ощущаю привязанность и сопричастность",
             "я всегда ощущаю привязанность и сопричастность"
            ],
        ["не думаю, что мир — это стоящее место",
             "думаю, что мир — довольно хорошее место",
             "думаю, что мир — это замечательное место",
             "по-моему, мир — это превосходное место"
            ],
        ["я редко смеюсь",
             "я смеюсь довольно часто",
             "я много смеюсь",
             "я очень часто смеюсь"
            ],
        ["я думаю, что выгляжу непривлекательно",
             "я думаю, что выгляжу довольно привлекательно",
             "я думаю, что выгляжу привлекательно",
             "я думаю, что выгляжу очень привлекательно"
            ],
        ["я не нахожу вокруг ничего забавного и интересного",
             "некоторые вещи я нахожу забавными",
             "большинство вещей кажутся мне забавными",
             "мне все кажется забавным и интересным"
            ]
    ]
}

