//
//  OxfordHappinessTestData.swift
//  PsychologyTest
//
//  Created by Кирилл Колено on 11/11/2017.
//  Copyright © 2017 BlackWoodTraders. All rights reserved.
//

import Foundation

struct OxfordHappinessTestData {
    let questions = [
        1: ["а": "я не чувствую себя счастливым",
            "б": "я чувствую себя довольно счастливым",
            "в": "я очень счастлив",
            "г": "я невероятно счастлив"
            ],
        2: ["а": "я смотрю в будущее без особого оптимизма",
            "б": "я смотрю в будущее с оптимизмом",
            "в": "мне кажется, будущее сулит мне много хорошего",
            "г": "я чувствую, что будущее переполнено надеждами и перспективами"
            ],
        3: ["а": "ничто в моей жизни по-настоящему меня не удовлетворяет",
            "б": "некоторые вещи в жизни меня удовлетворяют",
            "в": "меня удовлетворяет многое в моей жизни",
            "г": "я полностью удовлетворен всем в своей жизни"
            ],
        4: ["а": "я не ощущаю, что в жизни что-либо реально находится в моей власти",
            "б": "я чувствую, что контролирую свою жизнь, по крайней мере — отчасти",
            "в": "я чувствую, что в основном контролирую свою жизнь",
            "г": "я чувствую, что целиком контролирую все стороны своей жизни"
            ],
        5: ["а": "я не ощущаю, что жизнь вознаграждает меня по заслугам",
            "б": "я ощущаю, что в жизни мне воздается по заслугам",
            "в": "я ощущаю, что жизнь щедро вознаграждает меня",
            "г": "я ощущаю, что жизнь переполнена подарками"
            ],
        6: ["а": "",
            "б": "",
            "в": "",
            "г": ""
            ],
        7: ["а": "",
            "б": "",
            "в": "",
            "г": ""
            ],
        8: ["а": "",
            "б": "",
            "в": "",
            "г": ""
            ],
        9: ["а": "",
            "б": "",
            "в": "",
            "г": ""
            ],
        10: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        11: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        12: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        13: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        14: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        15: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        16: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        17: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        18: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        19: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        20: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        21: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        22: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        23: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        24: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        25: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        26: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        27: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        28: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ],
        29: ["а": "",
             "б": "",
             "в": "",
             "г": ""
            ]
    ]
}

